Repository: Richasy/FantasyCopilot
Catalog: src/App/Resources/Strings/*/Resources.resw
Source language: en_us
Languages: zh_cn

source: About this app
zh_cn: 关于此应用

source: Add prompt
zh_cn: 添加提示词

# AppDescription
source: An exploration of mutual achievement between humans and AI.
zh_cn: 人与AI相互成就的一次探索

# AppName
source: Fantasy Copilot
zh_cn: 小幻助理

source: Back
zh_cn: 返回

source: Cancel
zh_cn: 取消

source: Chat options
zh_cn: 对话选项

# ClearHistory
source: Clear the chat history
zh_cn: 清除对话记录

# ContinuousDialogue
source: Continuous Conversation
zh_cn: 连续对话

# Copyright
source: © {0} Richasy. All rights reserved.
zh_cn: © {0} Richasy。保留所有权利。

# FavoritePrompts
source: Star Prompts
zh_cn: 星标提示词

# DefaultConversationType
source: The default dialog type
zh_cn: 默认对话类型

# DefaultConversationTypeDescription
source: You can choose between consecutive or single rounds of conversation
zh_cn: 你可以选择连续或者单轮对话

source: Delete
zh_cn: 删除

source: Delete Prompt
zh_cn: 删除提示词

# DeletePromptTip
source: Delete the current custom prompt?
zh_cn: 是否删除当前自定义提示？

source: Delete Session
zh_cn: 删除会话

# DeleteSessionTip
source: Delete the current session?
zh_cn: 是否删除当前会话？

source: Description
zh_cn: 描述

source: Edit
zh_cn: 编辑

# Generic
source: General
zh_cn: 通用

source: License Terms
zh_cn: 许可条款

# MaximumResponseTokens
source: Maximum Output Tokens
zh_cn: 输出令牌最大值

# MaximumResponseTokensDescription
source: Approximately 4 characters for 1 token
zh_cn: 大约4个字符为1个令牌

source: Modify
zh_cn: 修改

source: New session
zh_cn: 新的会话

# NoMessage
source: No messages yet
zh_cn: 还没有消息

# NoMessageDescription
source: Enter content in the text box below to send a message!
zh_cn: 在下方的文本框中输入内容发送消息吧！

# NoPrompt
source: No custom prompts yet
zh_cn: 还没有自定义提示词

# NoPromptDescription
source: Try creating a new custom prompt!
zh_cn: 试着创建一个新的自定义提示词吧！

# NoSession
source: No saved sessions yet
zh_cn: 还没有保存的会话

# NoSessionDescription
source: Try saving a new session!
zh_cn: 试试将新会话保存吧！

source: Privacy Policy
zh_cn: 隐私策略

source: Prompt
zh_cn: 提示词

# PromptDescriptionPlaceholder
source: Describe the role of the prompt
zh_cn: 描述一下提示词的作用

# PromptTitlePlaceholder
source: Prompt Word Title
zh_cn: 提示词标题

source: Quit App
zh_cn: 退出应用

source: Resent
zh_cn: 重新发送

source: Sampling
zh_cn: 采样

# SamplingDescription
source: Set sampling parameters to determine the randomness of the answer
zh_cn: 设置采样参数，以此决定答案的随机性

source: Save
zh_cn: 保存

source: Saved Sessions
zh_cn: 保存的会话

source: Save session
zh_cn: 保存会话

source: Send feedback
zh_cn: 发送反馈

# SessionDescriptionPlaceholder
source: What is the session for?
zh_cn: 会话是做什么的？

# SessionPromptPlaceholder
source: Please enter the preset prompt content
zh_cn: 请输入预设的提示词内容

# SessionTitlePlaceholder
source: Give the session a name
zh_cn: 给会话取个名字

source: Settings
zh_cn: 设置

source: Single Conversation
zh_cn: 单次对话

# TemperatureDescription
source: Controls randomness, lowering the temperature will lead to less random completions.
zh_cn: 控制随机性，降低 temperature 会导致更少的随机完成。

source: Title
zh_cn: 标题

# TopPDescription
source: Control diversity through core sampling
zh_cn: 通过核采样控制多样性

# UserInputPlaceholderText
source: Please enter content
zh_cn: 请输入内容

source: Access key
zh_cn: 访问密钥

# AccessKeyPlaceholderText
source: Service access key
zh_cn: 访问服务的密钥

# AISetting
source: AI configuration
zh_cn: AI 配置

# AISettingDescription
source: AI service-related settings
zh_cn: AI 服务相关的设置项

source: Custom prompt
zh_cn: 自定义提示词

source: Chat model name
zh_cn: 对话模型名称

# ChatModelNamePlaceholderText
source: Model name
zh_cn: 部署的对话模型名称

source: Endpoint
zh_cn: 终结点

# EndpointPlaceholderText
source: Service endpoint
zh_cn: 访问接口的地址

source: Prompt Library
zh_cn: 提示词库

source: Start
zh_cn: 开始

source: Text to Speech
zh_cn: 文本转语音

source: Prompts
zh_cn: 提示词

source: Translate
zh_cn: 翻译

source: Favorite
zh_cn: 收藏

# OnlinePromptError
source: Online prompt acquisition failed
zh_cn: 在线提示获取失败

# OnlinePromptErrorDescription
source: There may be some problems with the data source, please click the refresh button in the upper right corner to try again
zh_cn: 数据源可能出现了一些问题，请点击右上角刷新按钮重试

# PromptPinned
source: Prompt pinned to favorites list
zh_cn: 提示已固定到收藏列表

source: Refresh
zh_cn: 刷新

source: Refresh Failed
zh_cn: 刷新失败

# AwesomePromptZh
source: Awesome ChatGPT Chinese Prompts
zh_cn: ChatGPT 中文调教指南

# CopyPrompt
source: Copy the prompt
zh_cn: 复制提示词

# FlowGptEnTrending
source: Flow GPT English hot list
zh_cn: Flow GPT 英文热榜

# FlowGptZhTrending
source: Flow GPT Chinese hot list
zh_cn: Flow GPT 中文热榜

source: Prompt Copied
zh_cn: 提示词已复制

# ChatInvalid
source: The chat service is not available
zh_cn: 对话服务不可用

# ChatInvalidDescription
source: Please complete the service configuration related to the chat in the settings
zh_cn: 请在设置中完善对话相关的服务配置

# AzureVoice
source: Azure Speech Service configuration
zh_cn: Azure 语音服务配置

# AzureVoiceDescription
source: Configuration items for Azure text-to-speech and speech recognition
zh_cn: Azure 文本转语音及语音识别的配置项

source: Region
zh_cn: 地区

# RegionPlaceholderText
source: Service region
zh_cn: 服务所处的地区

# FileSaved
source: The file is saved
zh_cn: 文件已保存

source: Generate speech
zh_cn: 生成语音

source: Language
zh_cn: 语言

# NeedInputText
source: Please enter text first
zh_cn: 请先输入文本

# NeedSelectVoice
source: Need to select a voice first
zh_cn: 需要先选择声音

# PlayAndPause
source: Play/Pause
zh_cn: 播放/暂停

source: Save Audio
zh_cn: 保存音频

# SpeechConvertFailed
source: Speech Conversion Failed
zh_cn: 语音转换失败

source: Speech Recognition
zh_cn: 语音识别

# VoiceInvalid
source: Voice service unavailable
zh_cn: 语音服务不可用

# VoiceInvalidDescription
source: Please complete the service configuration related to voice in the settings
zh_cn: 请在设置中完善语音相关的服务配置

source: Voice
zh_cn: 声音

source: Voice Service
zh_cn: 语音服务

# AutoDetect
source: Automatically detect
zh_cn: 自动检测

source: Recognized Text
zh_cn: 识别出的文本

source: Start recording
zh_cn: 开始录音

source: Stop Recording
zh_cn: 停止录音

# VoiceRecognizeFailed
source: Voice recognition failed
zh_cn: 语音识别失败

# AzureTranslate
source: Azure Translator
zh_cn: Azure 翻译

# TranslateInvalid
source: Translation service unavailable
zh_cn: 翻译服务不可用

# TranslateInvalidDescription
source: Please complete the service configuration related to translation in the settings
zh_cn: 请在设置中完善翻译相关的服务配置

source: Input content
zh_cn: 输入内容

source: Source Language
zh_cn: 源语言

source: Target Language
zh_cn: 目标语言

source: Translated content
zh_cn: 翻译结果

# TranslatedContentPlaceholderText
source: Translated text will be displayed here
zh_cn: 翻译后的文本将在这里显示

source: Retry
zh_cn: 重试

# TranslationFailed
source: Translation failed, please try again
zh_cn: 翻译失败，请重试

source: Audio search
zh_cn: 音频搜索

source: File search
zh_cn: 文件搜索

source: Image search
zh_cn: 图像搜索

# StorageInvalid
source: Storage search service unavailable
zh_cn: 存储搜索服务不可用

# StorageInvalidDescription
source: Storage search service requires Everything to be installed on the local machine first
zh_cn: 存储搜索服务需要先在本机安装 Everything

source: Storage Search
zh_cn: 存储搜索

# CopyPath
source: Copy the path
zh_cn: 复制路径

source: Open in file explorer
zh_cn: 在文件管理器中打开

# BeginStorageSearch
source: Search for local files
zh_cn: 搜索本地文件

# BeginStorageSearchDescription
source: Start searching for local files fast with Everything!
zh_cn: 利用 Everything 开始极速搜索本地文件吧！

# GenericSearch
source: Universal search
zh_cn: 通用搜索

# NoFiles
source: Files do not exist
zh_cn: 文件不存在

# NoFilesDescription
source: No files that meet the criteria were found
zh_cn: 没有找到符合条件的文件

# OpenFailed
source: Open failed, may be due to insufficient permissions or target file/folder does not exist
zh_cn: 打开失败，可能是权限不足或目标文件/文件夹不存在

source: Path Copied
zh_cn: 路径已复制

source: Audio
zh_cn: 音频

# AudioPlaceholderText
source: Searches for audio of the specified name
zh_cn: 搜索指定名称的音频

source: Directory
zh_cn: 目录

# DirectoryPlaceholderText
source: Get files or folders in the directory
zh_cn: 检索指定目录下的文件或文件夹

# Document
source: Documentation
zh_cn: 文档

# DocumentPlaceholderText
source: Searches for a document with the specified name
zh_cn: 搜索指定名称的文档

# DuplicateFiles
source: Duplicate name
zh_cn: 重名

# DuplicateFilesPlaceholderText
source: Search for a file with the same name
zh_cn: 搜索同名文件

# ExecuteFile
source: Program
zh_cn: 程序

# ExecuteFilePlaceholderText
source: Searches for an executable file of the specified name
zh_cn: 搜索指定名称的可执行文件

source: Image
zh_cn: 图片

# ImagePlaceholderText
source: Search for images by name
zh_cn: 搜索指定名称的图片

# OpenWith
source: Open with other software
zh_cn: 使用其它软件打开

source: Video
zh_cn: 视频

# VideoPlaceholderText
source: Search for videos with specified names
zh_cn: 搜索指定名称的视频

source: Zip
zh_cn: 压缩包

# ZipPlaceholderText
source: Search for a zip with the specified name
zh_cn: 搜索指定名称的压缩包

source: Album
zh_cn: 专辑

# AlbumPlaceholderText
source: Searches for music for the specified album
zh_cn: 搜索指定专辑的音乐

source: Artist
zh_cn: 艺术家

# ArtistPlaceholderText
source: Search for music by the specified artist
zh_cn: 搜索指定艺术家的音乐

source: Comment
zh_cn: 备注

source: Genre
zh_cn: 流派

# GenrePlaceholderText
source: Search for music by genre
zh_cn: 搜索指定流派的音乐

# MusicCommentPlaceholderText
source: Search for music with specified comment
zh_cn: 搜索包含指定备注的音乐

# MusicTitlePlaceholderText
source: Search for music with specified title
zh_cn: 搜索指定标题的音乐

# MusicTrack
source: Track number
zh_cn: 编号

# MusicTrackPlaceholderText
source: Search for music with specified track number
zh_cn: 搜索指定曲目编号的音乐

source: All
zh_cn: 全部

# Bit1
source: 1 bit
zh_cn: 1 比特

# Bit16
source: 16 bits
zh_cn: 16 比特

# Bit24
source: 24 bits
zh_cn: 24 比特

# Bit32
source: 32 bits
zh_cn: 32 比特

# Bit8
source: 8 bits
zh_cn: 8 比特

source: Color depth
zh_cn: 色深

source: Height
zh_cn: 高度

source: Landscape
zh_cn: 横向

source: Orientation
zh_cn: 方向

source: Portrait
zh_cn: 纵向

source: Width
zh_cn: 宽度

source: Modified time
zh_cn: 修改时间

source: Name (A to Z)
zh_cn: 名称（A 到 Z）

source: Name (Z to A)
zh_cn: 名称（Z 到 A）

source: Size (Large to Small)
zh_cn: 大小（从大到小）

source: Size (Small to Large)
zh_cn: 大小（从小到大）

source: Sort by
zh_cn: 排序依据

# TotalFileCount
source: Total
zh_cn: 总数

source: Type
zh_cn: 类型

# ConfigImported
source: The configuration file is imported
zh_cn: 配置文件已导入

# ExportConfig
source: Export configuration
zh_cn: 导出配置

# ExportConfigFailed
source: Failed to export configuration file
zh_cn: 导出配置文件失败

# ImportConfig
source: Import configuration
zh_cn: 导入配置

# ImportConfigFailed
source: Failed to import configuration file
zh_cn: 导入配置文件失败

# InvalidConfigFile
source: Invalid configuration file
zh_cn: 无效的配置文件

# ConfigExported
source: The configuration file is exported
zh_cn: 配置文件已导出

source: Services
zh_cn: 服务

source: Prompts and Sessions
zh_cn: 提示与会话

source: Remove message
zh_cn: 移除消息

source: Semantic Skill
zh_cn: 语义技能

source: Workflow
zh_cn: 工作流

source: Workspace
zh_cn: 工作间

source: Add semantic skill
zh_cn: 添加语义技能

source: Delete Semantic Skill
zh_cn: 删除语义技能

# DeleteSemanticSkillTip
source: Confirm the deletion of the semantic skill? Once deleted, if there is a workflow that references the skill, the workflow will not work
zh_cn: 是否确认删除该语义技能？删除后，如果有工作流引用该技能，则该工作流将无法正常工作

source: Frequency Penalty
zh_cn: 文本重复

# FrequencyPenaltyDescription
source: The higher the value, the less likely the resulting text is to have duplicate characters
zh_cn: 值越高，则后续产生的文本越不容易出现重复字符

# HowToWriteSemanticSkill
source: How to write semantic skills?
zh_cn: 如何编写语义技能？

# NeedFillRequiredFields
source: Please fill in the content completely
zh_cn: 请完整填写内容

# NoSemanticSkill
source: No semantic skills
zh_cn: 没有语义技能

# NoSemanticSkillDescription
source: Try adding a new semantic skill!
zh_cn: 试着添加一个新的语义技能吧！

source: Presence Penalty
zh_cn: 话题重复

# PresencePenaltyDescription
source: The higher the value, the easier it is for subsequent text to discuss new topics
zh_cn: 值越高，则后续文本越容易讨论新的话题

source: Repeatability
zh_cn: 重复度

# RepeatabilityDescription
source: Controls the repeatability of text or topics by the model
zh_cn: 控制模型对文字或话题的重复度

source: Semantic Skill Editor
zh_cn: 语义技能编辑

source: Skill Description
zh_cn: 技能描述

# SkillDescriptionPlaceholderText
source: Describe the purpose of this skill
zh_cn: 描述该技能的用途

source: Skill Name
zh_cn: 技能名

# SkillNamePlaceholderText
source: Give the skill a name
zh_cn: 给技能取个名字吧

# AddWorkflow
source: Add a workflow
zh_cn: 添加工作流

source: Delete Workflow
zh_cn: 删除工作流

# DeleteWorkflowTip
source: Delete the workflow?
zh_cn: 是否删除该工作流？

source: No workflow
zh_cn: 没有工作流

# NoWorkflowDescription
source: Try adding a new workflow!
zh_cn: 尝试添加一个新的工作流吧！

source: File input
zh_cn: 文件输入

source: Input
zh_cn: 输入

# NeedAddStep
source: Need to add at least one step
zh_cn: 需要添加至少一个步骤

source: Source Text
zh_cn: 源文本

source: Text
zh_cn: 文本

source: Text Input
zh_cn: 文本输入

# TextInputDescription
source: Input text content when the workflow starts
zh_cn: 在工作流开始时输入文本内容

source: Voice input
zh_cn: 语音输入

source: Workflow editor
zh_cn: 工作流编辑

# WorkflowFileOpenFailed
source: Workflow configuration file open failed
zh_cn: 工作流配置文件打开失败

# AddStep
source: Add a step
zh_cn: 添加步骤

# WorkflowGoal
source: Goal
zh_cn: 目标

# WorkflowGoalPlaceholderText
source: A clear goal description helps the "Give me inspiration" button to automatically generate workflow steps
zh_cn: 清晰的目标描述有助于“给我灵感”按钮自动生成工作流步骤

source: Workflow name
zh_cn: 工作流名称

# WorkflowNamePlaceholderText
source: Name the workflow
zh_cn: 给工作流命名

source: Add input
zh_cn: 添加输入

source: Reset
zh_cn: 重置

source: Steps
zh_cn: 步骤

source: Show Result
zh_cn: 显示结果

source: More Options
zh_cn: 更多选项

source: Move downward
zh_cn: 向下移动

source: Move upward
zh_cn: 向上移动

# NoValidResult
source: No suitable results found
zh_cn: 未找到合适的结果

source: Open link
zh_cn: 打开链接

source: Save as HTML
zh_cn: 另存为 HTML

source: Web
zh_cn: 网页

source: Markup Text
zh_cn: 标记文本

# NoOutputConfig
source: No output configuration
zh_cn: 没有输出配置

source: Output
zh_cn: 输出

source: Plain Text
zh_cn: 纯文本

source: Add output
zh_cn: 添加输出

# OutputText
source: Text Output
zh_cn: 文本输出

# OutputTextDescription
source: Display the final result in text form
zh_cn: 将最后的结果以文本的形式展示

# OutputVoice
source: Audio Output
zh_cn: 音频输出

# OutputVoiceDescription
source: Play audio according to the final generated file path
zh_cn: 根据最后生成的文件路径播放音频

# VoiceInputDescription
source: Convert to text input through voice recognition
zh_cn: 通过语音识别转换成文本输入

source: Play with Player
zh_cn: 使用播放器播放

source: Invalid file path
zh_cn: 无效的文件路径

# FileInputDescription
source: Select the specified file and enter the path as text
zh_cn: 选择指定的文件，将路径作为文本输入

source: Pick Folder
zh_cn: 选择文件夹

source: Pick File
zh_cn: 选择文件

source: File
zh_cn: 文件

source: File name (with extension)
zh_cn: 文件名（含扩展名）

source: Open file
zh_cn: 打开文件

source: Inspire me
zh_cn: 来点灵感

# NoAutoPlan
source: Unable to automatically generate plan temporarily
zh_cn: 暂时无法自动生成计划

source: Text overwrite
zh_cn: 文本覆写

# TextOverwriteDescription
source: Overwrite the input of the previous step
zh_cn: 覆写前一个步骤的输入

source: Image Service
zh_cn: 图片服务

# ImageServiceInvalid
source: Image Service Unavailable
zh_cn: 图片服务不可用

# ImageServiceInvalidDescription
source: Please provide a valid image generation service address
zh_cn: 请提供有效的图片生成服务地址

source: Image to image
zh_cn: 图生图

source: Text to Image
zh_cn: 文生图

# DeployUrl
source: Deployment URL
zh_cn: 部署网址

# DeployUrlPlaceholderText
source: Service link
zh_cn: 服务部署后的访问链接

# InvalidUrl
source: Invalid link
zh_cn: 无效的链接

# StableDiffusionDescription
source: Related configuration items for Stable Diffusion
zh_cn: Stable Diffusion 的相关配置项

# DataSourceComeFrom
source: Data from
zh_cn: 数据来自

source: Image Gallery
zh_cn: 图片库

# AllTime
source: All the time
zh_cn: 全部时间

source: CLIP skip
zh_cn: CLIP 终止层数

source: File save failed
zh_cn: 文件保存失败

# GalleryEmpty
source: The gallery is empty
zh_cn: 图库为空

# GalleryEmptyDescription
source: Can't get the list of images at the moment, please try again later
zh_cn: 暂时无法获取图片列表，请稍后再试

# HasImageMetadata
source: Contains Image Metadata
zh_cn: 包含图片元数据

source: Most Comments
zh_cn: 最多评论

source: Most reactions
zh_cn: 最多互动

# NegativePrompt
source: Negative prompt words
zh_cn: 负面提示词

source: Newest
zh_cn: 最新

# OpenInText2ImageModule
source: Open in Text to Image
zh_cn: 在文生图中打开

# RequestImageFailed
source: Failed to try to request the image
zh_cn: 尝试请求图片时失败

# Sampler
source: Sampling Algorithm
zh_cn: 采样算法

# Seed
source: Random Seed
zh_cn: 随机种子

source: This month
zh_cn: 本月

source: This week
zh_cn: 本周

source: This year
zh_cn: 今年

source: Time period
zh_cn: 时间范围

source: Today
zh_cn: 今日

source: Model Name
zh_cn: 模型名称

source: Save image
zh_cn: 保存图片

# RequestVoiceMetadataFailed
source: An error occurred when requesting voice metadata
zh_cn: 请求语音元数据时发生了错误

# EnableImage
source: Enable image module
zh_cn: 启用图片服务

# EnableImageDescription
source: When turned off, features such as the txt2img will be hidden
zh_cn: 关闭后将隐藏文生图等功能

# EnableChat
source: Enable chat module
zh_cn: 启用聊天

# EnableChatDescription
source: When turned off, chat-related features will be hidden
zh_cn: 关闭后将隐藏聊天相关的功能

# EnableStorage
source: Enable file module
zh_cn: 启用文件服务

# EnableStorageDescription
source: When turned off, the file search function is hidden
zh_cn: 关闭后将隐藏文件搜索功能

# EnableTranslate
source: Enable translation module
zh_cn: 启用翻译服务

# EnableTranslateDescription
source: When turned off, text translation will be hidden
zh_cn: 关闭后将隐藏文本翻译等功能

# EnableVoice
source: Enable speech module
zh_cn: 启用音频服务

# EnableVoiceDescription
source: When turned off, features such as speech recognition will be hidden
zh_cn: 关闭后将隐藏语音识别等功能

# FeatureEnabled
source: Enable features
zh_cn: 启用功能

# FeatureEnabledDescription
source: You can choose to enable or disable some feature modules
zh_cn: 你可以选择启用或禁用部分功能模块

# NeedRestart
source: Need to restart the app
zh_cn: 需要重启应用

# NeedRestartDescription
source: One or more of the settings you changed will take effect after restarting
zh_cn: 你更改的一个或多个设置需要重启后才能生效

source: Restart
zh_cn: 重启

# ContextConversation
source: Contextual conversations
zh_cn: 上下文对话

source: Embedding model name
zh_cn: 嵌入模型名称

# EmbeddingModelNamePlaceholderText
source: Model name
zh_cn: 部署的嵌入模型名称

source: Text completion model name
zh_cn: 文本完成模型名称

# TextCompletionModelNamePlaceholderText
source: Model name
zh_cn: 部署的文本完成模型名称

source: Reselect
zh_cn: 重新选择

# EmptyTextFile
source: The text file is empty
zh_cn: 文本文件为空

# MustBeValidTextFile
source: Must be a valid text file
zh_cn: 必须是有效的文本文件

# ConnectingImageService
source: Connecting to the image service
zh_cn: 正在连接图片服务

# Copied
source: Replicated
zh_cn: 已复制

# CopyExtraModelTip
source: Click on the entry to copy the model name
zh_cn: 点击条目即可复制模型名称

# Embeddings
source: Embedding models
zh_cn: 嵌入式模型

# GenerateImage
source: Generate a image
zh_cn: 生成图片

# ImageGenerateFailed
source: Image generation failed
zh_cn: 图片生成失败

# ImageModelDescription
source: Set the model for generating images
zh_cn: 设置生成图片的模型

# ImageNegativePromptPlaceholderText
source: Please list the contents that are not needed in the image
zh_cn: 请列举图片中不需要的内容

# ImagePromptPlaceholderText
source: Please enter a description of the image
zh_cn: 请输入图片描述

source: Image Service Disconnected
zh_cn: 图片服务已断开

source: Image Size
zh_cn: 图片大小

# ImageSizeDescription
source: Set the width and height of the generated image
zh_cn: 设置生成图片的宽度和高度

# Lora
source: Lora Model
zh_cn: Lora 模型

source: Metadata
zh_cn: 元数据

# ModelSearch
source: Search model
zh_cn: 搜索模型

source: Open in browser
zh_cn: 在浏览器中打开

# OtherImageOptionsDescription
source: Other numerical options for generating images
zh_cn: 其他用于生成图片的数值选项

source: Other Options
zh_cn: 其他选项

source: Reconnect
zh_cn: 重新连接

# SamplerDescription
source: Select an appropriate sampler
zh_cn: 选择合适的采样器

# ShowExtraModels
source: Show Additional Models
zh_cn: 显示附加模型

# EnableKnowledge
source: Enable knowledge base
zh_cn: 启用知识库

# EnableKnowledgeDescription
source: When closed, the knowledge base feature is hidden
zh_cn: 关闭后将隐藏知识库功能

source: Knowledge Base
zh_cn: 知识库

# CreateFromFile
source: Created from file
zh_cn: 从文件创建

# CreateFromFolder
source: Created from folder
zh_cn: 从文件夹创建

source: Import knowledge base
zh_cn: 导入知识库

# AlreadyHaveSameKnowledgeBase
source: An identical knowledge base already exists
zh_cn: 已经存在一个相同的知识库

source: Base name
zh_cn: 库名

# BaseNamePlaceholderText
source: Knowledge base name
zh_cn: 知识库名称

# ConnectDatabaseFailed
source: Failed to connect to the database
zh_cn: 连接数据库失败

# ConnectingDatabase
source: Connecting to database
zh_cn: 正在连接数据库

# CreatingKnowledgeBase
source: Data is being imported into the knowledge base
zh_cn: 正在将数据导入知识库

source: Database path
zh_cn: 数据库路径

# DatabasePathPlaceholderText
source: Select the database location
zh_cn: 选择数据库位置

source: Delete Knowledge Base
zh_cn: 删除知识库

# DeleteKnowledgeBaseDescription
source: Delete the knowledge base? (This does not affect the database file, only removal from the list)
zh_cn: 是否删除该知识库？（这不会影响到数据库文件，仅是从列表中移除）

# ImportFileSucceed
source: File imported successfully
zh_cn: 导入文件成功

# ImportFolderNotFullySucceed
source: Import folder not fully successful, failure number: {0}/{1}
zh_cn: 导入文件夹未完全成功，失败数：{0}/{1}

# ImportFolderSucceed
source: Import folder successfully
zh_cn: 导入文件夹成功

# KnowledgeInvalid
source: Knowledge Base Unavailable
zh_cn: 知识库不可用

# KnowledgeInvalidDescription
source: Please complete the configuration of the embedded model in the settings
zh_cn: 请在设置中完善嵌入模型的配置

source: Modify Knowledge Base
zh_cn: 修改知识库

# NoKnowledgeBase
source: No available knowledge base
zh_cn: 没有可用的知识库

# NoKnowledgeBaseDescription
source: You can create or import a knowledge base
zh_cn: 你可以创建或者导入一个知识库

# SearchPattern
source: File Filter
zh_cn: 文件过滤

# SearchPatternPlaceholderText
source: e.g. *.txt, *.md, only support plain text
zh_cn: 如 *.txt, *.md，仅支持纯文本

# ImportFileFailed
source: Failed to import file
zh_cn: 导入文件失败

source: Import
zh_cn: 导入

source: Import file
zh_cn: 导入文件

source: Import folder
zh_cn: 导入文件夹

source: Confirm
zh_cn: 确认

# ContextResponseTokenLength
source: Maxinum knowledge response tokens
zh_cn: 问答响应令牌数

# ContextResponseTokenLengthDescription
source: The maximum number of return tokens for the model when the knowledge base is Q&A
zh_cn: 知识库问答时模型的最大返回令牌数

# MaxParagraphTokenLength
source: Paragraph Segmentation Threshold
zh_cn: 段落分割阈值

# MaxParagraphTokenLengthDescription
source: The content length of the sub-cut paragraph when text segmentation
zh_cn: 在文本分割时，细分裁切段落的内容长度

# MaxSplitContentLength
source: Text Segmentation Threshold
zh_cn: 文本分割阈值

# MaxSplitContentLengthDescription
source: The number of characters imported into the knowledge base will be split when it reaches this threshold, which depends on the number of tokens supported by the embedded model you are using
zh_cn: 导入知识库的字符数达到此阈值则会被拆分，这取决于你使用的嵌入模型能支持的令牌数量

source: Accessibility
zh_cn: 可访问性

# CommandCount
source: Number of commands
zh_cn: 命令个数

# CommandIdMustBeGuid
source: The command identifier must be a GUID
zh_cn: 命令标识符必须为 GUID

# DeletePlugin
source: Remove Plugin
zh_cn: 删除插件

# DeletePluginDescription
source: Deleting the plug-in will clear the local cache of the plug-in, and the workflow associated with the plug-in needs to be reconfigured, do you want to confirm?
zh_cn: 删除插件将会把插件的本地缓存一并清除，与插件关联的工作流需要重新配置，是否确认？

source: Import plugin
zh_cn: 导入插件

# MustHaveCommand
source: Plugin command cannot be empty
zh_cn: 插件的命令不能为空

# MustHaveId
source: Must have an identifier (Id)
zh_cn: 必须具备标识符（Id）

# MustHaveNameOrDescription
source: Must specify a name (Name) or description (Description)
zh_cn: 必须指定名称（Name）或描述（Description）

source: Native
zh_cn: 本机

# NoPlugin
source: No plugins
zh_cn: 没有插件

# NoPluginDescription
source: You can import plugins with the suffix .fcpkg
zh_cn: 可以导入后缀为 .fcpkg 的插件

# NoRepositoryWarning
source: This plugin does not have a corresponding repository, which may have potential risks, please use it with caution
zh_cn: 该插件没有对应的存储库，可能具备潜在的风险，请谨慎使用

# OpenAuthorSite
source: Open author website
zh_cn: 打开作者网站
